<?php
$lang_i['install']                 = "Установка";
$lang_i['bread_lictexttitle']      = "Лицензионное<br />соглашение";
$lang_i['bread_database_setting']  = "Настройка параметров для<br />соединения с базой данных";
$lang_i['bread_install_type']      = "Выбор типа установки";
$lang_i['bread_stepstatus']        = "Создание учетной<br />записи Администратора";
$lang_i['bread_install_finish']    = "Установка<br />успешно завершена!";

$lang_i['database_setting_desc']   = "Пожалуйста, укажите параметры, необходимые для установки соединения с сервером базы данных.";
$lang_i['install_step']            = "Шаг";

$lang_i['install_demo']            = "Демонстрационный контент";
$lang_i['install_clear']           = "Чистая версия системы";
$lang_i['install_setting_desc']    = "Выберите тип установки системы";
$lang_i['olh_host']                = "В данном поле необходимо указать имя или IP адрес сервера базы данных. По умолчанию используется &quot;localhost&quot;.";
$lang_i['olh_user']                = "В данном поле необходимо указать имя пользователя для соединения с базой данных. По умолчанию &quot;root&quot;.";
$lang_i['olh_pass']                = "В данном поле необходимо указать пароль для соединения с базой данных. По умолчанию &quot;без пароля&quot;.";
$lang_i['olh_name']                = "В данном поле необходимо указать название используемой базы данных.";
$lang_i['olh_prf']                 = "В данном поле необходимо указать префикс, который будет установлен для всех таблиц в базе данных. Вы можете использоваь любое, буквенно - цифровое значение. По умолчанию значение сгенерировано случайно.";
$lang_i['olh_setting_desc']        = "Демонстрационный контент - система с установленными модулями и некоторыми примерами данных. Рекомендуется для первой установки и ознакомления с системой.";
$lang_i['database_setting_foot']   = "Если все параметры указаны верно и вы готовы продолжить установку, нажмите &quot;Сохранить и продолжить&quot;. Для прекращения установки нажмите &quot;Отменить установку&quot;.";
$lang_i['database_clean_and_save'] = "Очистить БД и продолжить";
$lang_i['database_setting_save']   = "Сохранить и продолжить";
$lang_i['exit']                    = "Отменить установку";

$lang_i['liztext']                 = "Пожалуйста, внимательно прочитайте лицензионное соглашение, прежде чем продолжить установку.";
$lang_i['lizagree']                = "Принимаю лицензионное соглашение.";
$lang_i['eulaok_msg']              = "Если вы принимаете лицензионное соглашение, нажмите &quot;Продолжить установку&quot;. Для прекращения установки нажмите &quot;Отменить установку&quot;.";
$lang_i['eulaok']                  = "Продолжить установку";
$lang_i['dbserver']                = "Адрес сервера базы данных:";
$lang_i['dbuser']                  = "Имя пользователя базы данных:";
$lang_i['dbname']                  = "Название базы данных:";
$lang_i['dbpass']                  = "Пароль базы данных:";
$lang_i['dbprefix']                = "Префикс для таблиц:";

$lang_i['admin_create']            = "Учетная запись Администратора успешно создана.";
$lang_i['header_logindata']        = "Пожалуйста, будьте предельно внимательны при заполнении полей.";
$lang_i['logindatas']              = "Данные для учетной записи:";
$lang_i['loginstar']               = "Поля отмеченные <span class=\"star\">*</span> обязательны для заполнения.";
$lang_i['username']                = "Имя пользователя:";
$lang_i['email']                   = "E-mail:";
$lang_i['password']                = "Пароль:";
$lang_i['firstname']               = "Ваше Имя:";
$lang_i['lastname']                = "Ваша Фамилия:";
$lang_i['phone']                   = "Контактный телефон:";
$lang_i['zip']                     = "Почтовый индекс";
$lang_i['street']                  = "Улица / № дома:";
$lang_i['town']                    = "Город:";
$lang_i['nousername']              = "Пожалуйста, укажите Имя пользователя";
$lang_i['nofirstname']             = "Пожалуйста, укажите Ваше Имя";
$lang_i['nolastname']              = "Пожалуйста, укажите Вашу Фамилию";
$lang_i['phone']                   = "Телефон:";

$lang_i['noemail']                 = "Пожалуйста, укажите E-mail адрес.";
$lang_i['email_no_specialchars']   = "Ошибка! E-mail адрес содержит недопустимые символы.";
$lang_i['nopass']                  = "Пожалуйста, укажите пароль";
$lang_i['pass_no_specialchars']    = "Ошибка! Пароль содержит специальные символы.";
$lang_i['install_finish_body']    .= "<ul class=\"messages\"><li class=\"highlight red\"><span>Удалите, пожалуйста, папку</span><h5>/install/</h5></li></ul>";
$lang_i['install_finish_body']    .= "<div class=\"clearfix\"></div><br /><div class=\"clearfix\"></div>";
$lang_i['install_finish_body']    .= "<ul class=\"messages\"><li class=\"highlight grey\">Для перехода в панель управления нажмите <a href=\"../admin/\"><strong>здесь</strong></a><br />Для перехода на сайт нажмите<a href=\"../\"><strong>здесь</strong></a></li></ul>";

$lang_i['structure']               = "Создание структуры базы данных:";
$lang_i['erroro']                  = "Возникла ошибка...";
$lang_i['erroro_more']             = "Возникли ошибки...";
$lang_i['secondchance']            = "Пожалуйста, устраните все ошибки и попробуйте снова.";
$lang_i['warning_force']           = "Внимание! Если вы продолжите установку, несмотря на все предупреждения об ошибках, программное обеспечение может работать некорректно.";
$lang_i['button_setup_final']      = "Завершить установку";
$lang_i['helpeconn']               = "";
$lang_i['confirm_exit']            = "Вы уверены, что хотите отменить установку?";
$lang_i['templates_c_notwritable'] = "<pre><b>Ошибка!</b><br />Невозможно продолжить установку системы по причине отсутствия прав на запись в папку <strong>\"/cache/smarty/\"</strong>.<br />Пожалуйста, измените права с помощью Вашего FTP клиента.";
$lang_i['enoconn']                 = "Невозможно установить соединение с базой данных. Пожалуйста, проверьте параметры.";
$lang_i['installed_q']             = "Соединение с базой данных установлено, однако в ней обнаружены таблицы с указанным Вами префиксом.<br />Пожалуйста, измените префикс либо нажмите 'Очистить БД и продолжить' (будут удалены только таблицы с указанным Вами префиксом).";
$lang_i['installed']               = "Внимание, система уже установлена. Если вам необходимо выполнить дополнительную установку, пожалуйста, используйте другую базу данных.<br /><br />Чтобы перейти на сайт, <a href=\"/\">нажмите здесь</a>";
$lang_i['error_is_required']       = "Файл <strong>'";
$lang_i['error_is_required_2']     = "'</strong> не существует.";
$lang_i['error_is_writeable']      = "Папка <strong>'";
$lang_i['error_is_writeable_2']    = "'</strong> не имеет прав на запись.";
$lang_i['phpversion_toold']        = "Текущая версия PHP устарела. Для работы системы требуется версия не ниже: ";
$lang_i['force']                   = "Игнорировать предупреждения";
$lang_i['force_impossibly']        = "невозможно!";
$lang_i['config_isnt_writeable']   = "Ошибка! Файл '/inc/db.config.php' не имеет прав на запись.<br />Пожалуйста, измените права на файл с помощью вашего FTP-клиента.";
$lang_i['check_pass']              = "Пожалуйста, проверьте пароль.";
$lang_i['pass_too_small']          = "Указанный пароль слишком короткий, минимальная длина пароля должна быть <b>не менее</b> 5 символов.";
$lang_i['check_username']          = "Пожалуйста, проверьте Имя пользователя.";
$lang_i['check_name']              = "Пожалуйста, проверьте Ваше Имя.";
$lang_i['check_last_name']         = "Пожалуйста, проверьте Вашу Фамилию.";
$lang_i['error_reload']            = "Попытаться продолжить установку";
?>